[
  {
    "semester": "Semester-6",
    "subjects": [
      {
        "name": "Compiler Design",
        "code": "CS602",
        "units": [
          {
            "name": "Unit-I Introduction to compiling & Lexical Analysis",
            "topics": "Introduction of Compiler, Major data Structure in compiler, types of Compiler, Front-end and Backend of compiler, Compiler structure: analysis-synthesis model of compilation, various phases of a compiler, Lexical analysis: Input buffering , Specification & Recognition of Tokens,Design of a Lexical Analyzer Generator, LEX."
          },
          {
            "name": "Unit-II Syntax Analysis &Syntax Directed Translation",
            "topics": "Syntax analysis: CFGs, Top down parsing, Brute force approach, recursive descent parsing, transformation on the grammars, predictive parsing, bottom up parsing, operator precedence parsing, LR parsers (SLR,LALR, LR),Parser generation. Syntax directed definitions: Construction of Syntax  trees, Bottom up evaluation of S-attributed definition, L-attribute definition, Top down translation, Bottom Up evaluation of inherited attributes Recursive Evaluation, Analysis of Syntax directed definition"
          }
        ]
      },
      {
        "name":"Graph theory",
        "code": "CS603",
        "units": [
          {
            "name": "Unit-I",
            "topics": "Graphs, Sub graphs, some basic properties, various example of graphs & their sub graphs, walks,trails, path & circuits, connected graphs, disconnected graphs and component, various operation on graphs, Euler graphs, Hamiltonian paths and circuits, the traveling salesman problem, directed graphs, some types of directed graphs, directed paths and connectedness, Hamiltonian and Euler digraphs."
          },
          {
            "name": "Unit-II ",
            "topics": "Trees and fundamental circuits, distance diameters, radius and pendent vertices, rooted and binary trees, on counting trees, spanning trees, fundamental circuits, finding all spanning trees of a graph and a weighted graph, trees with directed edges, fundamental circuits in digraph, algorithms of Prim, Kruskal and Dijkstra."
          }
        ]
      },
      
          {
            "name": "HTML: Basics of HTML, formatting and fonts, commenting code, color, hyperlink, lists,",
            "code": "tables,",
            "units": [
              {
                "name": "Unit-I",
                "topics": "images, forms, XHTML, Meta tags, Character entities, frames and frame sets, Browser"
              }
            ]
          },
          {
            "name": "1. Code, compile and run a Java",
            "code": "program.",
            "units": [
              {
                "name": "Unit- I",
                "topics": "Introduction:   Characteristics   of   programming   Languages,   Factors   influencing   the   evolution  of"
              }
            ]
          },
          {
            "name": "6. Evaluate assembly language programs and download the machine code that",
            "code": "will",
            "units": []
          },
          {
            "name": "4. To learn efficient machine Language Code Generation using the techniques",
            "code": "of",
            "units": []
          },
          {
            "name": "6. Understands Intermediate Code Generation and Code",
            "code": "Optimization.",
            "units": [
              {
                "name": "Unit-I Introduction to compiling & Lexical Analysis",
                "topics": "Introduction of Compiler, Major data Structure in compiler, types of Compiler, Front-end and Back-"
              },
              {
                "name": "Unit-II Syntax Analysis &Syntax Directed Translation",
                "topics": "Syntax   analysis:   CFGs,   Top   down   parsing,   Brute   force   approach,   recursive   descent   parsing,"
              },
              {
                "name": "Unit-III Type Checking & Run Time Environment",
                "topics": "Type  checking:  type  system,  specification  of  simple  type  checker,  equivalence  of  expression,  types,"
              }
            ]
          },
          {
            "name": "Unit –IV Code",
            "code": "Generation",
            "units": []
          },
          {
            "name": "Intermediate code generation: Declarations, Assignment statements, Boolean expressions,",
            "code": "Case",
            "units": []
          },
          {
            "name": "statements, Back patching, Procedure calls Code Generation: Issues in the design of code",
            "code": "generator,",
            "units": []
          },
          {
            "name": "peephole optimization, generating code from",
            "code": "DAG.",
            "units": []
          },
          {
            "name": "Unit –V Code",
            "code": "Optimization",
            "units": []
          },
          {
            "name": "Introduction to Code optimization: sources of optimization of basic blocks, loops in flow graphs,",
            "code": "dead",
            "units": []
          },
          {
            "name": "code elimination, loop optimization, Introduction to global data flow analysis, Code",
            "code": "Improving",
            "units": []
          },
          {
            "name": "transformations ,Data flow analysis of structure flow graph Symbolic debugging of optimized",
            "code": "code.",
            "units": [
              {
                "name": "Unit- I",
                "topics": "Graphs,  Sub  graphs,  some  basic  properties,  various  example  of  graphs  &  their  sub  graphs,  walks,"
              },
              {
                "name": "Unit- II",
                "topics": "Trees  and  fundamental  circuits,  distance  diameters,  radius  and  pendent  vertices,  rooted  and  binary"
              },
              {
                "name": "Unit-I Introduction  to  Raster  Scan  displays,  Pixels,  Frame  buffer,  Vector  &  Character",
                "topics": "generation,  Random  Scan  systems,  Display  devices,  Scan  Conversion  techniques,  Line"
              },
              {
                "name": "Unit-II 2-D  Transformation:  Translation,  Rotation,  Scaling,  Shearing,  Reflection.  Inverse",
                "topics": "Transformation,   Homogeneous   coordinate   system,   Matrices   Transformation,   Composite"
              },
              {
                "name": "Unit-III 3-D Transformations: Translation, Rotation and Scaling. Parallel & Perspective",
                "topics": "Projection:  Types  of  Parallel  &  Perspective  Projection,  Hidden  Surface  elimination:  Depth"
              },
              {
                "name": "Unit-IV Visualization:  Visualization  of  2D/3D  scalar  fields:  color  mapping,  ISO  surfaces.",
                "topics": "Direct volume data rendering: ray-casting, transfer functions, segmentation. Visualization of"
              }
            ]
          },
          {
            "name": "Unit –V Multimedia :Basic of multimedia, application of Multimedia, Text-Types,",
            "code": "Unicode",
            "units": []
          },
          {
            "name": "training, testing, unstable gradient problem, auto encoders, batch normalization, dropout,",
            "code": "L1",
            "units": [
              {
                "name": "Unit-1: Basics  of  Soft  Computing - Introduction,  Fuzzy  Computing,  Neural  Computing,",
                "topics": "Genetic   Algorithms,   Associative   Memory,   Adaptive   Resonance   Theory,   Applications."
              },
              {
                "name": "Unit-2: Back-propagation   Networks - Background,   Back-Propagation   Learning,   Back-",
                "topics": "Propagation  Algorithm.  Associative  Memory - Description,  Auto-associative  Memory,  Bi-"
              },
              {
                "name": "Unit-3: Adaptive Resonance Theory -Recap supervised, unsupervised, backprop algorithms;",
                "topics": "Competitive Learning;  Stability-Plasticity Dilemma (SPD), ART Networks,"
              },
              {
                "name": "Unit-4: Fuzzy  Systems– Introduction,  Fuzzy  Logic,  Fuzzification,  Fuzzy  Inference,  Fuzzy",
                "topics": "Rule  Based   System,   Defuzzification. Genetic   algorithms   &   Modeling- Introduction,"
              },
              {
                "name": "Unit-5: Integration  of  Neural  Networks,  Fuzzy  Logic  and  Genetic  Algorithms -  GA  Based",
                "topics": "Back   Propagation   Networks,   Fuzzy   Back   Propagation   Networks,   Fuzzy   Associative"
              },
              {
                "name": "Unit-1: Overview and Introduction: Internet of Things (IoT) and Web of Things (WoT): What's",
                "topics": "WoT?, The Internet of Things Today, Time for Convergence, Towards the IoT Universe, Internet,"
              },
              {
                "name": "Unit-2: M2M  to  IoT  A  Basic  Perspective:  Introduction,  Some  Definitions, M2M  Value  Chains,",
                "topics": "IoT Value Chains, An emerging industrial structure for IoT, The international driven, global value"
              },
              {
                "name": "Unit-3: IoT Architecture -State of the Art: Introduction, State of the art, Architecture Reference",
                "topics": "Model- Introduction,  Reference  Model  and  architecture,  IoT  reference  Model,  IoT  Reference"
              },
              {
                "name": "Unit-4: IoT Applications for Value Creations: Introduction, IoT applications for industry: Future",
                "topics": "Factory  Concepts,  Brownfield  IoT,  Smart  Objects,  Smart  Applications,  Four  Aspects  in  your"
              },
              {
                "name": "Unit-5: Internet   of   Things   Privacy,   Security   and   Governance:   Introduction,   Overview   of",
                "topics": "Governance, Privacy and Security Issues, Contribution from FP7 Projects, Security, Privacy and"
              }
            ]
          },
          {
            "name": "5. Be able to design, code and test digital image processing",
            "code": "applications.",
            "units": []
          },
          {
            "name": "layering of a file system call from API to driver. Object-orientation patterns in kernel code;",
            "code": "a",
            "units": [
              {
                "name": "Unit-4: Semantics, Word Sense Disambiguation, Semantic parsing, Subjectivity and sentiment",
                "topics": "analysis."
              },
              {
                "name": "Unit-6: Information retrieval and Question answering, Machine translation.",
                "topics": "Text Book:"
              },
              {
                "name": "Unit-1",
                "topics": "Fundamentals  of  Cloud  Computing: Fundamental  concepts  of  Distributed Systems,  IT"
              },
              {
                "name": "Unit-2",
                "topics": "Infrastructure-As-A-Service   (Iaas): Virtualization   Overview,   Virtualized   Data   Center"
              },
              {
                "name": "Unit-3",
                "topics": "Platform-As-A-Service   (Paas): PaaS:   Overview,   Web   Application   Frameworks,   Web"
              },
              {
                "name": "Unit-4",
                "topics": "Cloud Security: Cloud Security: Information Security, Basic Terminology, Security Domains,"
              },
              {
                "name": "Unit-5",
                "topics": "Hadoop in  Cloud  Computing: Overview  of  Big  Data  Analytics,  Overview  of  Hadoop  and"
              }
            ]
          },
          {
            "name": "9. Mark C. Chu-Carroll, Code in the Cloud: Programming Google App Engine,",
            "code": "Pragmatic",
            "units": [
              {
                "name": "Unit-V: Reliability modeling & performance evaluation, crash recovery in databases, and voting",
                "topics": "methods."
              }
            ]
          },
          {
            "name": "video games, and code analysis and product recommendations. Such applications use",
            "code": "AI",
            "units": [
              {
                "name": "Unit-1  (Introduction  to  AI): Definitions,  Goals  of  AI,  AI  Approaches,  AI  Techniques,",
                "topics": "Branches  of  AI,  Applications  of  AI. Introduction  of  Intelligent  Systems: Agents  and"
              },
              {
                "name": "Unit-2 (Problems Solving, Search and Control Strategies)",
                "topics": "Solving   Problems   by   Searching, Study   and   analysis   of   various   searching   algorithms."
              },
              {
                "name": "Unit- 3 (Knowledge Representations Issues, Predicate Logic, Rules)",
                "topics": "Knowledge representation, KR using predicate logic, KR using rules."
              },
              {
                "name": "Unit-4 (Quantifying Uncertainty, Learning Systems)",
                "topics": "Acting  under  Uncertainty,  Basic  Probability  Notation,  Inference  Using  Full  Joint  Distributions,"
              },
              {
                "name": "Unit-5 (Expert Systems)",
                "topics": "Introduction,  Knowledge  acquisition,  Knowledge  base,  Working  memory,  Inference  engine,"
              }
            ]
          }
        ]
      }
    ]
  
